Repository: ECCC-CSSP/CSSPReportWriterHelperDLL
Catalog: CSSPReportWriterHelperDLL/Services/Resources/ReportServiceRes.*.resx
Languages: fr

# AllowableConditionTermsAre_
source: Allowable condition terms are {0}
fr: Allowable condition terms are {0} (fr)

# AllowableFilters_
source: Allowable filters [{0}]
fr: Allowable filters [{0}] (fr)

# AllowableLanguages_
source: Allowable languages {0}
fr: Allowable languages {0} (fr)

# AllowableValuesFor_In_
source: Allowable values for {0} in {1}
fr: Allowable values for {0} in {1} (fr)

# AllowableValues_
source: Allowable values {0}
fr: Allowable values {0} (fr)

source: All tags must be within a Start tag
fr: All tags must be within a Start tag (fr)

# ChildTVTypeIsRequiredIfParentTVItemIDIsNotZero
source: ChildTVType is required if ParentTVItemID is not 0
fr: ChildTVType is required if ParentTVItemID is not 0 (fr)

# ConditionTextMissingNumberAfter_
source: ConditionText missing number after {0}
fr: ConditionText missing number after {0} (fr)

# ConditionTextMissingSecondNumberAfter_
source: ConditionText missing second number after {0}
fr: ConditionText missing second number after {0} (fr)

# ConditionTextMissingTextAfter_
source: ConditionText missing text after {0}
fr: ConditionText missing text after {0} (fr)

source: Condition text should not be empty
fr: Condition text should not be empty (fr)

# ConditionTextShouldNotContain_
source: ConditionText should not contain {0}
fr: ConditionText should not contain {0} (fr)

# Condition_MissingValue
source: Condition {0} missing value
fr: Condition {0} missing value (fr)

# Condition_NotWellFormed
source: Condition [{0}] not well formed
fr: Condition [{0}] not well formed (fr)

source: Could not find first line. Returns are required.
fr: Could not find first line. Returns are required. (fr)

source: Could not find return in tag
fr: Could not find return in tag (fr)

# CouldNotFindTagToRemove_
source: Could not find tag to remove {0}
fr: Could not find tag to remove {0} (fr)

# CouldNotFindTag_
source: Could not find tag {0}
fr: Could not find tag {0} (fr)

# CouldNotFind_StartingAt_
source: Could not find [{0}] starting at {1}
fr: Could not find [{0}] starting at {1} (fr)

# Example_
source: Example {0}
fr: Example {0} (fr)

source: First item should be Start
fr: First item should be Start (fr)

source: First tag in document must be a start tag
fr: First tag in document must be a start tag (fr)

source: fr or en
fr: fr or en (fr)

# GetReportTypeReturnedNullFor_
source: GetReportType returned null for {0}
fr: GetReportType returned null for {0} (fr)

# ItemName_NotAllowed
source: Item name {0} not allowed
fr: Item name {0} not allowed (fr)

# Language_NotAllowed
source: Language {0} not allowed
fr: Language {0} not allowed (fr)

# Line_Item_ShouldBeANumber
source: Line {0} item {1} should be a number
fr: Line {0} item {1} should be a number (fr)

# Line_Item_ShouldBeOneOf_
source: Line {0} item {1} should be one of {2}
fr: Line {0} item {1} should be one of {2} (fr)

# Line_ShouldHave_Items
source: Line {0} should have {1} items
fr: Line {0} should have {1} items (fr)

# Line_ShouldStartWith_
source: Line {0} should start with {1}
fr: Line {0} should start with {1} (fr)

source: No tag found in document
fr: No tag found in document (fr)

# No_TagFoundInDocument
source: No {0} tag found in document
fr: No {0} tag found in document (fr)

source: Please select appropriate starting web page
fr: Please select appropriate starting web page (fr)

source: Start or Loop
fr: Start or Loop (fr)

# StartPos_ShouldBeSmallerThanEndPos_
source: StartPos {0} should be smaller than EndPos {1}
fr: StartPos {0} should be smaller than EndPos {1} (fr)

source: Start tag must not reside in a table
fr: Start tag must not reside in a table (fr)

source: Tag name should be Start or Loop
fr: Tag name should be Start or Loop (fr)

# Tag_NotImplemented
source: Tag [{0}] not implemented
fr: Tag [{0}] not implemented (fr)

# Tag_NotWellFormedItShouldHaveAStructureLike_
source: Tag {0} not well formed. It should have a structure like {1}
fr: Tag {0} not well formed. It should have a structure like {1} (fr)

source: Text between markers is empty
fr: Text between markers is empty (fr)

# TooManyConditionsFor_
source: Too many conditions for {0}
fr: Too many conditions for {0} (fr)

# Variable_DoesNotExistForItem_
source: Variable {0} does not exist for item {1}
fr: Variable {0} does not exist for item {1} (fr)

# Variable_NotUseWithinTag
source: Variable {0} not used within tag
fr: Variable {0} not used within tag (fr)

# Variable_WasNotIdentifiedAndIsUsedWithinTag
source: Variable {0} was not identified and is used within tag
fr: Variable {0} was not identified and is used within tag (fr)

# _DoesNotContain_Items
source: [{0}] does not contain {1} items
fr: [{0}] does not contain {1} items (fr)

# _IsNotAnAllowableConditionTerms_
source: {0} is not an allowable condition terms {1}
fr: {0} is not an allowable condition terms {1} (fr)

# _IsRequiredForLine_AndItem_
source: {0} is required for line {1} and item {2}
fr: {0} is required for line {1} and item {2} (fr)

# _IsRequiredIn_
source: {0} is required in {1}
fr: {0} is required in {1} (fr)

# _NotImplementedIn_
source: {0} not implemented in {1}
fr: {0} not implemented in {1} (fr)

# _ShouldEndWith_
source: {0} should end with {1}
fr: {0} should end with {1} (fr)

# _ShouldNotBeNullOrEmpty
source: [{0}] should not be null or empty.
fr: [{0}] should not be null or empty. (fr)

# _TagMustBeFollowedWithAReturn
source: {0} tag must be followed with a return
fr: {0} tag must be followed with a return (fr)

# FirstLineOfCSVTemplateShouldNotContain_
source: First line of CSV template should not contain {0}
fr: First line of CSV template should not contain {0} (fr)

# FirstLineVariableCount_DoesNotEqualToResultCount_
source: First line variable count {0} does not equal result count {1}
fr: First line variable count {0} does not equal result count {1} (fr)

source: One Start tag is required
fr: One Start tag is required (fr)

source: Only one Start tag is allowed in CSV template
fr: Only one Start tag is allowed in CSV template (fr)

# Tag_HasMoreThan1ChildTagWhichIsNotAllowedInCSVTemplates
source: Tag {0} has more than 1 child tag which is not allowed in CSV templates
fr: Tag {0} has more than 1 child tag which is not allowed in CSV templates (fr)

# _OfTag_DoesNotExistAtLine_
source: {0} of tag {1} does not exist at line {2}
fr: {0} of tag {1} does not exist at line {2} (fr)

source: Please select a field
fr: Please select a field (fr)

# AllowableDocumentTypes_
source: Allowable document types {0}
fr: Allowable document types {0} (fr)

source: CSVTagText is empty
fr: CSVTagText is empty (fr)

source: RangeStartTag text is empty
fr: RangeStartTag text is empty (fr)

# Line_Has_ParametersTheMaximumIs_
source: Line {0} has {1} parameters. The maximum is {2}
fr: Line {0} has {1} parameters. The maximum is {2} (fr)

# FileDoesNotExist_
source: File does not exist [{0}]
fr: File does not exist [{0}] (fr)

# YouHaveATag_WhichIsNotClosedProperly
source: You have a tag {0} which is not closed properly
fr: You have a tag {0} which is not closed properly (fr)

# _TagDoesNotAllowSorting
source: {0} tag does not allow sorting
fr: {0} tag does not allow sorting (fr)

# Enum_NotFoundShouldBeOneOf_
source: Enum [{0}] not found. Should be one of [{1}]
fr: Enum [{0}] not found. Should be one of [{1}] (fr)

# ReportFieldTypeIs_ItHasToBeOneOf_
source: ReportFieldType is {0}. It has to be one of {1}
fr: ReportFieldType is {0}. It has to be one of {1} (fr)

# _DoesNotExistFor_
source: {0} does not exist for {1}
fr: {0} does not exist for {1} (fr)

# Condition_NotWellFormed_Requires_
source: Condition {0} not well formed. {1} requires {2}
fr: Condition {0} not well formed. {1} requires {2} (fr)

# NumberWithoutDecimalIsRequiredAfter_
source: Number without decimal is required after {0}
fr: Number without decimal is required after {0} (fr)

# _IsRequiredWhenUsing_For_Condition
source: {0} is required when using {1} for {2} condition
fr: {0} is required when using {1} for {2} condition (fr)

# CouldNotClearAllRowsOfSubsectorSpecialTable_
source: Could not clear all rows of Subsector Special Table {0}
fr: Could not clear all rows of Subsector Special Table {0} (fr)

# CouldNotConvertToFloat_
source: Could not convert to float {0}
fr: Could not convert to float {0} (fr)

# ParamValuesStringNotWellFormed_
source: Param values string not well formed {0}
fr: Param values string not well formed {0} (fr)

# _ShouldOnlyHave_Items
source: {0} should only have {1} item(s)
fr: {0} should only have {1} item(s) (fr)

# _TagShouldNotBeWithinATable
source: {0} tag should not be within a table
fr: {0} tag should not be within a table (fr)

# DateStringNotWellFormed_ItShouldBeSomethingLike_
source: Date string not well formed {0}. It should be something like {1}
fr: Date string not well formed {0}. It should be something like {1} (fr)

source: End
fr: End (fr)

source: Rain (mm)
fr: Rain (mm) (fr)

source: Start
fr: Start (fr)

source: Start and end tides
fr: Start and end tides (fr)

# SubTypeAndLetterStringNotWellFormed_ItShouldBeSomethingLike_
source: Sub type and letter string not well formed {0}. It should be something like {1}
fr: Sub type and letter string not well formed {0}. It should be something like {1} (fr)

# MaximumNumberOfPrecipitationDaysIs_
source: Maximum number of precipitation days is {0}
fr: Maximum number of precipitation days is {0} (fr)

# FirstLineOfKMLTemplateShouldNotContain_
source: First line of KML template should not contain {0}
fr: First line of KML template should not contain {0} (fr)

source: Only one Start tag is allowed in KML template
fr: Only one Start tag is allowed in KML template (fr)

# Tag_HasMoreThan1ChildTagWhichIsNotAllowedInKMLTemplates
source: Tag {0} has more than 1 child tag which is not allowed in KML templates
fr: Tag {0} has more than 1 child tag which is not allowed in KML templates (fr)

source: KMLTagText is empty
fr: KMLTagText is empty (fr)

# MaximumNumberOfSigmaLayers_
source: Maximum number of sigma layer [{0}].
fr: Maximum number of sigma layer [{0}]. (fr)

source: Not implemented yet.
fr: Not implemented yet. (fr)

# PFS_Error_
source: PFS {0} Error {1}
fr: PFS {0} Error {1} (fr)

source: All nodes are smaller than contour value
fr: All nodes are smaller than contour value (fr)

source: Boundary conditions
fr: Boundary conditions (fr)

source: Contour value
fr: Contour value (fr)

source: Coordinates
fr: Coordonnées

# CouldNotFindFile_
source: Could not find file {0}
fr: Could not find file {0} (fr)

# CouldNotFind_With_Equal_
source: Could not find {0} with {1} equal {2}
fr: Could not find {0} with {1} equal {2} (fr)

# CouldNotFind__
source: Could not find {0} {1}
fr: Could not find {0} {1} (fr)

# DayLowerCase
source: day
fr: jour

source: Element nodes
fr: Element nodes (fr)

# ElementType_IsNotSupported
source: Element type {0} is not supported
fr: Element type {0} is not supported (fr)

source: Error
fr: Error (fr)

# FCMPNPer100ML
source: FC
fr: CF

# FCMPNPer100MLEnd
source: FC at the end
fr: CF à la fin

# FCMPNPer100MLStart
source: FC at the beginning
fr: CF au début

source: Flow
fr: Débit

# FlowEnd
source: Flow at the end
fr: Débit à la fin

# FlowStart
source: Flow at the beginning
fr: Débit au début

source: Is continuous
fr: continuel

source: Is not continuous
fr: discontinu

source: MIKE 3 not implemented yet
fr: MIKE 3 not implemented yet (fr)

source: MIKE boundary condition code
fr: MIKE boundary condition code (fr)

source: MIKE boundary condition format
fr: MIKE boundary condition format (fr)

source: MIKE boundary condition length
fr: MIKE boundary condition length (fr)

source: MIKE boundary condition level or velocity
fr: MIKE boundary condition level or velocity (fr)

source: MIKE boundary condition name
fr: MIKE boundary condition name (fr)

source: MIKE boundary conditions
fr: MIKE boundary conditions (fr)

source: MIKE mesh
fr: MIKE mesh (fr)

source: MIKE pollution animation
fr: MIKE pollution animation (fr)

source: MIKE pollution limit
fr: MIKE pollution limit (fr)

source: MIKE source name is empty
fr: MIKE source name is empty (fr)

source: MIKE study area
fr: MIKE study area (fr)

source: Model input
fr: Model input (fr)

source: nodes
fr: noeuds

# NotUsedLowerCase
source: not used
fr: pas utilisé

source: Number of web tide nodes
fr: Number of web tide nodes (fr)

source: parameter type
fr: parameter type (fr)

source: Pollution animation
fr: Pollution animation (fr)

source: Pollution contour
fr: Pollution contour (fr)

source: Pollution limits
fr: Pollution limits (fr)

source: Salinity
fr: Salinité

# SalinityEnd
source: Salinity at the end
fr: Salinité à la fin

# SalinityStart
source: Salinity at the beginning
fr: Salinité au début

source: Source included
fr: Source included (fr)

source: Source Not Included
fr: Source non incluse

source: Spill
fr: Débordement

# SpillEndTime
source: Spill Time at the end
fr: Temps à la fin du débordement

# SpillStartTime
source: Spill time at the beginning
fr: Temps au début du débordement

source: Temperature
fr: Température

# TemperatureEnd
source: Temperature at the end
fr: Température à la fin

# TemperatureStart
source: Temperature at the beginning
fr: Température au début

# UsedLowerCase
source: used
fr: utilisé

source: Web tide data set
fr: Web tide data set (fr)

source: Web tide nodes
fr: Web tide nodes (fr)

source: Average Decay Factor
fr: Taux de décroissance moyen

source: Decay is constant
fr: Taux Décoissance constant

source: Decay is variable
fr: Taux Décoissance variable

# DegreeLowerCase
source: degree
fr: degré

source: FC MPN Pollution Contour
fr: CF Contour pollution

# IncludedLowerCase
source: included
fr: inclus

source: Manning number
fr: Manning number (fr)

source: Model parameters
fr: Model parameters (fr)

# NorthClockwiseLowerCase
source: north clockwise
fr: Nord dans le sens horaire

# NotIncludedLowerCase
source: not included
fr: pas inclus

source: No Wind
fr: aucun vent

source: Result Frequency
fr: Fréquence des résultats

source: Wind
fr: Vent

source: Wind Direction
fr: Direction du vent

source: Top of layer
fr: Sommet de la strate

source: Bottom of layer
fr: Bas de la strate

source: Depths
fr: Profondeurs

source: Polygons
fr: Polygones
